Revit 2024 API
DirectContext3DHandleSettings Constructor (Boolean, Int32)
 Constructs an instance of settings with provided values.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public DirectContext3DHandleSettings(
	bool visibility,
	int transparency
)
Visual Basic
Public Sub New ( _
	visibility As Boolean, _
	transparency As Integer _
)
Visual C++
public:
DirectContext3DHandleSettings(
	bool visibility,
	int transparency
)
Parameters
visibility
Type: System.Boolean
 Source visibility.
transparency
Type: System.Int32
 Source transparency.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The value is invalid. The valid range is 0 through 100
See Also
DirectContext3DHandleSettings Class
DirectContext3DHandleSettings Overload
Autodesk.Revit.DB.DirectContext3D Namespace